In [1]:
#Initial imports 
import numpy as np
import pandas as pd 
from pandas import DataFrame, Series
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats
%matplotlib inline
from IPython.core.interactiveshell import InteractiveShell #Show all consecutive outputs
InteractiveShell.ast_node_interactivity = "all"

#Removes all unnecessary warnings by Python
import warnings
warnings.filterwarnings('ignore')

# Imports for better visualization

from collections import defaultdict
import scipy as sp
from matplotlib import rcParams
import matplotlib.cm as cm
import matplotlib as mpl

#colorbrewer2 Dark2 qualitative color table
dark2_colors = [(0.10588235294117647, 0.6196078431372549, 0.4666666666666667),
                (0.8509803921568627, 0.37254901960784315, 0.00784313725490196),
                (0.4588235294117647, 0.4392156862745098, 0.7019607843137254),
                (0.9058823529411765, 0.1607843137254902, 0.5411764705882353),
                (0.4, 0.6509803921568628, 0.11764705882352941),
                (0.9019607843137255, 0.6705882352941176, 0.00784313725490196),
                (0.6509803921568628, 0.4627450980392157, 0.11372549019607843)]

rcParams['figure.figsize'] = (14, 6)
rcParams['figure.dpi'] = 250
rcParams['axes.color_cycle'] = dark2_colors
rcParams['lines.linewidth'] = 3
rcParams['axes.facecolor'] = 'white'
rcParams['font.size'] = 25
rcParams['patch.edgecolor'] = 'white'
rcParams['patch.facecolor'] = dark2_colors[0]
rcParams['font.family'] = 'StixGeneral'

#Show all the columns 
pd.set_option('display.max_columns',None)


#Reading in all the data from different datasets 
fractr = pd.read_csv('train.csv')

In [2]:
train = fractr

In [3]:
train = pd.read_csv('train.csv', parse_dates=True)
test = pd.read_csv('test.csv',parse_dates=True)

In [7]:
train.head()

,ID,Item_ID,Category_3,Category_2,Category_1,Price,Number_Of_Sales,Date
0,30495_20140101,30495,0,2.0,90,165.123,1,2014-01-01
1,30375_20140101,30375,0,2.0,307,68.666,5,2014-01-01
2,30011_20140101,30011,0,3.0,67,253.314,2,2014-01-01
3,30864_20140101,30864,0,2.0,315,223.122,1,2014-01-01
4,30780_20140101,30780,1,2.0,132,28.750,1,2014-01-01

In [5]:
train['Date'] = pd.to_datetime(train['Datetime'])
test['Date'] = pd.to_datetime(test['Datetime'])

In [6]:
# del train['Datetime']
# del test['Datetime']

In [8]:
import datetime

In [9]:
train['Tarikh'] = train['Date'].dt.day
train['Month'] = train['Date'].dt.month
train['Year'] = train['Date'].dt.year
test['Tarikh'] = test['Date'].dt.day
test['Month'] = test['Date'].dt.month
test['Year'] = test['Date'].dt.year

In [12]:
train.head()
test.head()

,ID,Item_ID,Category_3,Category_2,Category_1,Price,Number_Of_Sales,Date,Tarikh,Month,Year
0,30495_20140101,30495,0,2.0,90,165.123,1,2014-01-01,1,1,2014
1,30375_20140101,30375,0,2.0,307,68.666,5,2014-01-01,1,1,2014
2,30011_20140101,30011,0,3.0,67,253.314,2,2014-01-01,1,1,2014
3,30864_20140101,30864,0,2.0,315,223.122,1,2014-01-01,1,1,2014
4,30780_20140101,30780,1,2.0,132,28.750,1,2014-01-01,1,1,2014

,Item_ID,Category_1,Category_2,Category_3,ID,Date,Tarikh,Month,Year
0,30413,235,3.0,0,30413_20160701,2016-07-01,1,7,2016
1,30413,235,3.0,0,30413_20160702,2016-07-02,2,7,2016
2,30413,235,3.0,0,30413_20160703,2016-07-03,3,7,2016
3,30413,235,3.0,0,30413_20160704,2016-07-04,4,7,2016
4,30413,235,3.0,0,30413_20160705,2016-07-05,5,7,2016

In [11]:
from xgboost.sklearn import XGBRegressor
from sklearn.cross_validation import cross_val_score, train_test_split
from sklearn.metrics import accuracy_score
xgb = XGBRegressor(n_estimators=500, objective='reg:linear', silent=False)

C:\Users\NISHANT\Anaconda3\lib\site-packages\sklearn\cross_validation.py:44: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [26]:
x_train, x_test, y_train, y_test = train_test_split(train.drop(['Item_ID', 'ID','Date','Number_Of_Sales','Price'], axis=1), train['Number_Of_Sales'])
xgb.fit(x_train, y_train)

XGBRegressor(base_score=0.5, colsample_bylevel=1, colsample_bytree=1, gamma=0,
       learning_rate=0.1, max_delta_step=0, max_depth=3,
       min_child_weight=1, missing=None, n_estimators=500, nthread=-1,
       objective='reg:linear', reg_alpha=0, reg_lambda=1,
       scale_pos_weight=1, seed=0, silent=False, subsample=1)

In [27]:
test1 = test

In [29]:
test1.head()

   Category_1  Category_2  Category_3  Tarikh  Month  Year
0         235         3.0           0       1      7  2016
1         235         3.0           0       2      7  2016
2         235         3.0           0       3      7  2016
3         235         3.0           0       4      7  2016
4         235         3.0           0       5      7  2016

In [30]:
# test1 = test
# del test1['Date']
# del test1['ID']
# del test1['Item_ID']

In [31]:
test1 = test1[['Category_3', 'Category_2', 'Category_1', 'Tarikh', 'Month', 'Year']]

In [32]:
test1['Number_Of_Sales'] = xgb.predict(test1)

In [33]:
test1.head()

   Category_3  Category_2  Category_1  Tarikh  Month  Year  Number_Of_Sales
0           0         3.0         235       1      7  2016       446.380768
1           0         3.0         235       2      7  2016       448.035431
2           0         3.0         235       3      7  2016       475.884216
3           0         3.0         235       4      7  2016       468.142029
4           0         3.0         235       5      7  2016       463.721039

In [34]:
x_train1, x_test1, y_train1, y_test1 = train_test_split(train.drop(['Item_ID', 'ID','Date','Price'], axis=1), train['Price'])
xgb.fit(x_train1, y_train1)

XGBRegressor(base_score=0.5, colsample_bylevel=1, colsample_bytree=1, gamma=0,
       learning_rate=0.1, max_delta_step=0, max_depth=3,
       min_child_weight=1, missing=None, n_estimators=500, nthread=-1,
       objective='reg:linear', reg_alpha=0, reg_lambda=1,
       scale_pos_weight=1, seed=0, silent=False, subsample=1)

In [35]:
test1 = test1[['Category_3', 'Category_2', 'Category_1','Number_Of_Sales', 'Tarikh', 'Month', 'Year']]
test1['Price'] = xgb.predict(test1)

In [36]:
test1.head()

,Category_3,Category_2,Category_1,Number_Of_Sales,Tarikh,Month,Year,Price
0,0,3.0,235,446.380768,1,7,2016,5.366904
1,0,3.0,235,448.035431,2,7,2016,5.366904
2,0,3.0,235,475.884216,3,7,2016,5.181914
3,0,3.0,235,468.142029,4,7,2016,5.360390
4,0,3.0,235,463.721039,5,7,2016,5.360390

In [37]:
del test1['Category_1']
del test1['Category_2']
del test1['Category_3']
del test1['Year']
del test1['Tarikh']
del test1['Month']

In [38]:
test = pd.read_csv('test.csv')
test1['ID'] = test['ID']

In [39]:
test1.head()

   Number_Of_Sales     Price              ID
0       446.380768  5.366904  30413_20160701
1       448.035431  5.366904  30413_20160702
2       475.884216  5.181914  30413_20160703
3       468.142029  5.360390  30413_20160704
4       463.721039  5.360390  30413_20160705

In [40]:
test1 = test1[['ID','Number_Of_Sales','Price']]

In [41]:
test1.to_csv("logical12_sp.csv",index = False)

In [42]:
test2 = pd.read_csv("logical12_sp.csv")

In [44]:
test2.head()

               ID  Number_Of_Sales     Price
0  30413_20160701       446.380768  5.366904
1  30413_20160702       448.035431  5.366904
2  30413_20160703       475.884216  5.181914
3  30413_20160704       468.142029  5.360390
4  30413_20160705       463.721039  5.360390